wwoods93/stm32f4_base/Core/layer_0/w_hal.cpp
    }

    void dac_init()
    {
        DAC_ChannelConfTypeDef sConfig = {0};
        hdac.Instance = DAC;
        if (HAL_DAC_Init(&hdac) != HAL_OK)
        {
            error_handler();
        }

        sConfig.DAC_Trigger = DAC_TRIGGER_NONE;
        sConfig.DAC_OutputBuffer = DAC_OUTPUTBUFFER_ENABLE;
        if (HAL_DAC_ConfigChannel(&hdac, &sConfig, DAC_CHANNEL_1) != HAL_OK)
        {
            error_handler();
        }
    }

    void i2c2_init()
    {
        hi2c2.Instance = I2C2;
        hi2c2.Init.ClockSpeed = 100000;
        hi2c2.Init.DutyCycle = I2C_DUTYCYCLE_2;
        hi2c2.Init.OwnAddress1 = 0;
        hi2c2.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
        hi2c2.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
        hi2c2.Init.OwnAddress2 = 0;
        hi2c2.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
        hi2c2.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
        if (HAL_I2C_Init(&hi2c2) != HAL_OK)
        {
            error_handler();
        }
    }

    void iwdg_init()
    {
        hiwdg.Instance = IWDG;
        hiwdg.Init.Prescaler = IWDG_PRESCALER_4;
        hiwdg.Init.Reload = 4095;
        if (HAL_IWDG_Init(&hiwdg) != HAL_OK)
        {
            error_handler();
        }
    }






    void spi1_init()
    {
        hspi1.Instance = SPI1;
        hspi1.Init.Mode = SPI_MODE_MASTER;
        hspi1.Init.Direction = SPI_DIRECTION_2LINES;
        hspi1.Init.DataSize = SPI_DATASIZE_8BIT;
        hspi1.Init.CLKPolarity = SPI_POLARITY_LOW;
        hspi1.Init.CLKPhase = SPI_PHASE_2EDGE;
        hspi1.Init.NSS = SPI_NSS_SOFT;
        hspi1.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_4;
        hspi1.Init.FirstBit = SPI_FIRSTBIT_MSB;
        hspi1.Init.TIMode = SPI_TIMODE_DISABLE;
        hspi1.Init.CRCCalculation = SPI_CRCCALCULATION_ENABLE;
        hspi1.Init.CRCPolynomial = 10;
        if (HAL_SPI_Init(&hspi1) != HAL_OK)
        {
            error_handler();
        }
    }

    void spi3_init()
    {
        hspi3.Instance = SPI3;
        hspi3.Init.Mode = SPI_MODE_MASTER;
        hspi3.Init.Direction = SPI_DIRECTION_2LINES;
        hspi3.Init.DataSize = SPI_DATASIZE_8BIT;
        hspi3.Init.CLKPolarity = SPI_POLARITY_LOW;
        hspi3.Init.CLKPhase = SPI_PHASE_1EDGE;
        hspi3.Init.NSS = SPI_NSS_SOFT;
        hspi3.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_2;
        hspi3.Init.FirstBit = SPI_FIRSTBIT_MSB;
        hspi3.Init.TIMode = SPI_TIMODE_DISABLE;
        hspi3.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
        hspi3.Init.CRCPolynomial = 10;
        if (HAL_SPI_Init(&hspi3) != HAL_OK)
        {
            error_handler();
        }
    }


    void gpio_init()
    {
        GPIO_InitTypeDef GPIO_InitStruct = {0};

        /* GPIO Ports Clock Enable */
        __HAL_RCC_GPIOC_CLK_ENABLE();
        __HAL_RCC_GPIOH_CLK_ENABLE();
        __HAL_RCC_GPIOA_CLK_ENABLE();
        __HAL_RCC_GPIOB_CLK_ENABLE();
        __HAL_RCC_GPIOD_CLK_ENABLE();


        HAL_GPIO_WritePin(GPIOA, LD2_Pin|OUTPUT_A11_Pin|OUTPUT_A15_Pin, GPIO_PIN_RESET);


        HAL_GPIO_WritePin(GPIOC, OUTPUT_C4_Pin|OUTPUT_C9_Pin|OUTPUT_C10_Pin|OUTPUT_C11_Pin, GPIO_PIN_RESET);


        HAL_GPIO_WritePin(GPIOB, SPI2_CS1_Pin|SPI2_CS2_Pin, GPIO_PIN_SET);

        HAL_GPIO_WritePin(SPI3_CS1_GPIO_Port, SPI3_CS1_Pin, GPIO_PIN_SET);

        HAL_GPIO_WritePin(OUTPUT_A10_GPIO_Port, OUTPUT_A10_Pin, GPIO_PIN_SET);

        HAL_GPIO_WritePin(OUTPUT_D2_GPIO_Port, OUTPUT_D2_Pin, GPIO_PIN_RESET);

        HAL_GPIO_WritePin(GPIOB, OUTPUT_B3_Pin|OUTPUT_B4_Pin, GPIO_PIN_RESET);

        GPIO_InitStruct.Pin = B1_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        HAL_GPIO_Init(B1_GPIO_Port, &GPIO_InitStruct);

        GPIO_InitStruct.Pin = ANALOG_C0_Pin|ANALOG_C3_Pin|ANALOG_C5_Pin|ANALOG_C6_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

        GPIO_InitStruct.Pin = ANALOG_A1_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        HAL_GPIO_Init(ANALOG_A1_GPIO_Port, &GPIO_InitStruct);

        GPIO_InitStruct.Pin = LD2_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
        HAL_GPIO_Init(LD2_GPIO_Port, &GPIO_InitStruct);

        GPIO_InitStruct.Pin = OUTPUT_C4_Pin|OUTPUT_C9_Pin|OUTPUT_C10_Pin|OUTPUT_C11_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
        HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

        GPIO_InitStruct.Pin = ANALOG_B0_Pin|ANALOG_B1_Pin|ANALOG_B2_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

        GPIO_InitStruct.Pin = SPI2_CS1_Pin|SPI2_CS2_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
        HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

        GPIO_InitStruct.Pin = SPI3_CS1_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
        HAL_GPIO_Init(SPI3_CS1_GPIO_Port, &GPIO_InitStruct);

        GPIO_InitStruct.Pin = GPIO_PIN_8;
        GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
        GPIO_InitStruct.Alternate = GPIO_AF0_MCO;
        HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

        GPIO_InitStruct.Pin = INPUT_A9_Pin|INPUT_A12_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

        GPIO_InitStruct.Pin = OUTPUT_A10_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
        HAL_GPIO_Init(OUTPUT_A10_GPIO_Port, &GPIO_InitStruct);

        GPIO_InitStruct.Pin = OUTPUT_A11_Pin|OUTPUT_A15_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
        HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

        GPIO_InitStruct.Pin = OUTPUT_D2_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
        HAL_GPIO_Init(OUTPUT_D2_GPIO_Port, &GPIO_InitStruct);

