wwoods93/stm32f4_base/Core/layer_0/w_hal.cpp
        GPIO_InitStruct.Pin = OUTPUT_B3_Pin|OUTPUT_B4_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
        HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

        GPIO_InitStruct.Pin = INPUT_B5_Pin|INPUT_B6_Pin|INPUT_B7_Pin|INPUT_B8_Pin
                              |INPUT_B9_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

        HAL_NVIC_SetPriority(EXTI15_10_IRQn, 5, 0);
        HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);
    }

    void uart2_init()
    {
        huart2.Instance = USART2;
        huart2.Init.BaudRate = 115200;
        huart2.Init.WordLength = UART_WORDLENGTH_8B;
        huart2.Init.StopBits = UART_STOPBITS_1;
        huart2.Init.Parity = UART_PARITY_NONE;
        huart2.Init.Mode = UART_MODE_TX_RX;
        huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
        huart2.Init.OverSampling = UART_OVERSAMPLING_16;
        if (HAL_UART_Init(&huart2) != HAL_OK)
        {
            error_handler();
        }
    }

    HAL_StatusTypeDef rcc_oscillator_config(RCC_OscInitTypeDef  *RCC_OscInitStruct)
    {
        uint32_t tickstart, pll_config;

        /* Check Null pointer */
        if(RCC_OscInitStruct == NULL)
        {
            return HAL_ERROR;
        }

        /* Check the parameters */
        assert_param(IS_RCC_OSCILLATORTYPE(RCC_OscInitStruct->OscillatorType));
        /*------------------------------- HSE Configuration ------------------------*/
        if(((RCC_OscInitStruct->OscillatorType) & RCC_OSCILLATORTYPE_HSE) == RCC_OSCILLATORTYPE_HSE)
        {
            /* Check the parameters */
            assert_param(IS_RCC_HSE(RCC_OscInitStruct->HSEState));
            /* When the HSE is used as system clock or clock source for PLL in these cases HSE will not disabled */
#if defined(STM32F446xx)
            if((__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_CFGR_SWS_HSE)                                                                     ||\
      ((__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_CFGR_SWS_PLL) && ((RCC->PLLCFGR & RCC_PLLCFGR_PLLSRC) == RCC_PLLCFGR_PLLSRC_HSE)) ||\
      ((__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_CFGR_SWS_PLLR) && ((RCC->PLLCFGR & RCC_PLLCFGR_PLLSRC) == RCC_PLLCFGR_PLLSRC_HSE)))
#else
                if((__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_CFGR_SWS_HSE)                                                                     ||\
      ((__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_CFGR_SWS_PLL) && ((RCC->PLLCFGR & RCC_PLLCFGR_PLLSRC) == RCC_PLLCFGR_PLLSRC_HSE)))
#endif /* STM32F446xx */
            {
                if((__HAL_RCC_GET_FLAG(RCC_FLAG_HSERDY) != RESET) && (RCC_OscInitStruct->HSEState == RCC_HSE_OFF))
                {
                    return HAL_ERROR;
                }
            }
            else
            {
                /* Set the new HSE configuration ---------------------------------------*/
                __HAL_RCC_HSE_CONFIG(RCC_OscInitStruct->HSEState);

                /* Check the HSE State */
                if((RCC_OscInitStruct->HSEState) != RCC_HSE_OFF)
                {
                    /* Get Start Tick*/
                    tickstart = HAL_GetTick();

                    /* Wait till HSE is ready */
                    while(__HAL_RCC_GET_FLAG(RCC_FLAG_HSERDY) == RESET)
                    {
                        if((HAL_GetTick() - tickstart ) > HSE_TIMEOUT_VALUE)
                        {
                            return HAL_TIMEOUT;
                        }
                    }
                }
                else
                {
                    /* Get Start Tick*/
                    tickstart = HAL_GetTick();

                    /* Wait till HSE is bypassed or disabled */
                    while(__HAL_RCC_GET_FLAG(RCC_FLAG_HSERDY) != RESET)
                    {
                        if((HAL_GetTick() - tickstart ) > HSE_TIMEOUT_VALUE)
                        {
                            return HAL_TIMEOUT;
                        }
                    }
                }
            }
        }
        /*----------------------------- HSI Configuration --------------------------*/
        if(((RCC_OscInitStruct->OscillatorType) & RCC_OSCILLATORTYPE_HSI) == RCC_OSCILLATORTYPE_HSI)
        {
            /* Check the parameters */
            assert_param(IS_RCC_HSI(RCC_OscInitStruct->HSIState));
            assert_param(IS_RCC_CALIBRATION_VALUE(RCC_OscInitStruct->HSICalibrationValue));

            /* Check if HSI is used as system clock or as PLL source when PLL is selected as system clock */
#if defined(STM32F446xx)
            if((__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_CFGR_SWS_HSI)                                                                     ||\
      ((__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_CFGR_SWS_PLL) && ((RCC->PLLCFGR & RCC_PLLCFGR_PLLSRC) == RCC_PLLCFGR_PLLSRC_HSI)) ||\
      ((__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_CFGR_SWS_PLLR) && ((RCC->PLLCFGR & RCC_PLLCFGR_PLLSRC) == RCC_PLLCFGR_PLLSRC_HSI)))
#else
                if((__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_CFGR_SWS_HSI)                                                                     ||\
      ((__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_CFGR_SWS_PLL) && ((RCC->PLLCFGR & RCC_PLLCFGR_PLLSRC) == RCC_PLLCFGR_PLLSRC_HSI)))
#endif /* STM32F446xx */
            {
                /* When HSI is used as system clock it will not disabled */
                if((__HAL_RCC_GET_FLAG(RCC_FLAG_HSIRDY) != RESET) && (RCC_OscInitStruct->HSIState != RCC_HSI_ON))
                {
                    return HAL_ERROR;
                }
                    /* Otherwise, just the calibration is allowed */
                else
                {
                    /* Adjusts the Internal High Speed oscillator (HSI) calibration value.*/
                    __HAL_RCC_HSI_CALIBRATIONVALUE_ADJUST(RCC_OscInitStruct->HSICalibrationValue);
                }
            }
            else
            {
                /* Check the HSI State */
                if((RCC_OscInitStruct->HSIState)!= RCC_HSI_OFF)
                {
                    /* Enable the Internal High Speed oscillator (HSI). */
                    __HAL_RCC_HSI_ENABLE();

                    /* Get Start Tick*/
                    tickstart = HAL_GetTick();

                    /* Wait till HSI is ready */
                    while(__HAL_RCC_GET_FLAG(RCC_FLAG_HSIRDY) == RESET)
                    {
                        if((HAL_GetTick() - tickstart ) > HSI_TIMEOUT_VALUE)
                        {
                            return HAL_TIMEOUT;
                        }
                    }

                    /* Adjusts the Internal High Speed oscillator (HSI) calibration value.*/
                    __HAL_RCC_HSI_CALIBRATIONVALUE_ADJUST(RCC_OscInitStruct->HSICalibrationValue);
                }
                else
                {
                    /* Disable the Internal High Speed oscillator (HSI). */
                    __HAL_RCC_HSI_DISABLE();

                    /* Get Start Tick*/
                    tickstart = HAL_GetTick();

                    /* Wait till HSI is ready */
                    while(__HAL_RCC_GET_FLAG(RCC_FLAG_HSIRDY) != RESET)
                    {
                        if((HAL_GetTick() - tickstart ) > HSI_TIMEOUT_VALUE)
                        {
                            return HAL_TIMEOUT;
                        }
                    }
                }
            }
        }
        /*------------------------------ LSI Configuration -------------------------*/
        if(((RCC_OscInitStruct->OscillatorType) & RCC_OSCILLATORTYPE_LSI) == RCC_OSCILLATORTYPE_LSI)
        {
            /* Check the parameters */
            assert_param(IS_RCC_LSI(RCC_OscInitStruct->LSIState));

            /* Check the LSI State */
            if((RCC_OscInitStruct->LSIState)!= RCC_LSI_OFF)
            {
                /* Enable the Internal Low Speed oscillator (LSI). */
                __HAL_RCC_LSI_ENABLE();

                /* Get Start Tick*/
                tickstart = HAL_GetTick();

                /* Wait till LSI is ready */
                while(__HAL_RCC_GET_FLAG(RCC_FLAG_LSIRDY) == RESET)
                {
                    if((HAL_GetTick() - tickstart ) > LSI_TIMEOUT_VALUE)
                    {
                        return HAL_TIMEOUT;
                    }
                }
            }
            else
            {
                /* Disable the Internal Low Speed oscillator (LSI). */
                __HAL_RCC_LSI_DISABLE();

                /* Get Start Tick*/
                tickstart = HAL_GetTick();

                /* Wait till LSI is ready */
                while(__HAL_RCC_GET_FLAG(RCC_FLAG_LSIRDY) != RESET)
                {
                    if((HAL_GetTick() - tickstart ) > LSI_TIMEOUT_VALUE)
                    {
                        return HAL_TIMEOUT;
                    }
                }
            }
        }
        /*------------------------------ LSE Configuration -------------------------*/
        if(((RCC_OscInitStruct->OscillatorType) & RCC_OSCILLATORTYPE_LSE) == RCC_OSCILLATORTYPE_LSE)
        {
            FlagStatus       pwrclkchanged = RESET;

            /* Check the parameters */
            assert_param(IS_RCC_LSE(RCC_OscInitStruct->LSEState));

