wwoods93/stm32f4_base/Core/layer_0/w_hal.cpp
            /* Update LSE configuration in Backup Domain control register    */
            /* Requires to enable write access to Backup Domain of necessary */
            if(__HAL_RCC_PWR_IS_CLK_DISABLED())
            {
                __HAL_RCC_PWR_CLK_ENABLE();
                pwrclkchanged = SET;
            }

            if(HAL_IS_BIT_CLR(PWR->CR, PWR_CR_DBP))
            {
                /* Enable write access to Backup domain */
                SET_BIT(PWR->CR, PWR_CR_DBP);

                /* Wait for Backup domain Write protection disable */
                tickstart = HAL_GetTick();

                while(HAL_IS_BIT_CLR(PWR->CR, PWR_CR_DBP))
                {
                    if((HAL_GetTick() - tickstart) > RCC_DBP_TIMEOUT_VALUE)
                    {
                        return HAL_TIMEOUT;
                    }
                }
            }

            /* Set the new LSE configuration -----------------------------------------*/
            __HAL_RCC_LSE_CONFIG(RCC_OscInitStruct->LSEState);
            /* Check the LSE State */
            if((RCC_OscInitStruct->LSEState) != RCC_LSE_OFF)
            {
                /* Get Start Tick*/
                tickstart = HAL_GetTick();

                /* Wait till LSE is ready */
                while(__HAL_RCC_GET_FLAG(RCC_FLAG_LSERDY) == RESET)
                {
                    if((HAL_GetTick() - tickstart ) > RCC_LSE_TIMEOUT_VALUE)
                    {
                        return HAL_TIMEOUT;
                    }
                }
            }
            else
            {
                /* Get Start Tick*/
                tickstart = HAL_GetTick();

                /* Wait till LSE is ready */
                while(__HAL_RCC_GET_FLAG(RCC_FLAG_LSERDY) != RESET)
                {
                    if((HAL_GetTick() - tickstart ) > RCC_LSE_TIMEOUT_VALUE)
                    {
                        return HAL_TIMEOUT;
                    }
                }
            }

            /* Restore clock configuration if changed */
            if(pwrclkchanged == SET)
            {
                __HAL_RCC_PWR_CLK_DISABLE();
            }
        }
        /*-------------------------------- PLL Configuration -----------------------*/
        /* Check the parameters */
        assert_param(IS_RCC_PLL(RCC_OscInitStruct->PLL.PLLState));
        if ((RCC_OscInitStruct->PLL.PLLState) != RCC_PLL_NONE)
        {
            /* Check if the PLL is used as system clock or not */
            if(__HAL_RCC_GET_SYSCLK_SOURCE() != RCC_CFGR_SWS_PLL)
            {
                if((RCC_OscInitStruct->PLL.PLLState) == RCC_PLL_ON)
                {
                    /* Check the parameters */
                    assert_param(IS_RCC_PLLSOURCE(RCC_OscInitStruct->PLL.PLLSource));
                    assert_param(IS_RCC_PLLM_VALUE(RCC_OscInitStruct->PLL.PLLM));
                    assert_param(IS_RCC_PLLN_VALUE(RCC_OscInitStruct->PLL.PLLN));
                    assert_param(IS_RCC_PLLP_VALUE(RCC_OscInitStruct->PLL.PLLP));
                    assert_param(IS_RCC_PLLQ_VALUE(RCC_OscInitStruct->PLL.PLLQ));
                    assert_param(IS_RCC_PLLR_VALUE(RCC_OscInitStruct->PLL.PLLR));

                    /* Disable the main PLL. */
                    __HAL_RCC_PLL_DISABLE();

                    /* Get Start Tick*/
                    tickstart = HAL_GetTick();

                    /* Wait till PLL is ready */
                    while(__HAL_RCC_GET_FLAG(RCC_FLAG_PLLRDY) != RESET)
                    {
                        if((HAL_GetTick() - tickstart ) > PLL_TIMEOUT_VALUE)
                        {
                            return HAL_TIMEOUT;
                        }
                    }

                    /* Configure the main PLL clock source, multiplication and division factors. */
                    WRITE_REG(RCC->PLLCFGR, (RCC_OscInitStruct->PLL.PLLSource                                            | \
                                 RCC_OscInitStruct->PLL.PLLM                                                 | \
                                 (RCC_OscInitStruct->PLL.PLLN << RCC_PLLCFGR_PLLN_Pos)                       | \
                                 (((RCC_OscInitStruct->PLL.PLLP >> 1U) - 1U) << RCC_PLLCFGR_PLLP_Pos)        | \
                                 (RCC_OscInitStruct->PLL.PLLQ << RCC_PLLCFGR_PLLQ_Pos)                       | \
                                 (RCC_OscInitStruct->PLL.PLLR << RCC_PLLCFGR_PLLR_Pos)));
                    /* Enable the main PLL. */
                    __HAL_RCC_PLL_ENABLE();

                    /* Get Start Tick*/
                    tickstart = HAL_GetTick();

                    /* Wait till PLL is ready */
                    while(__HAL_RCC_GET_FLAG(RCC_FLAG_PLLRDY) == RESET)
                    {
                        if((HAL_GetTick() - tickstart ) > PLL_TIMEOUT_VALUE)
                        {
                            return HAL_TIMEOUT;
                        }
                    }
                }
                else
                {
                    /* Disable the main PLL. */
                    __HAL_RCC_PLL_DISABLE();

                    /* Get Start Tick*/
                    tickstart = HAL_GetTick();

                    /* Wait till PLL is ready */
                    while(__HAL_RCC_GET_FLAG(RCC_FLAG_PLLRDY) != RESET)
                    {
                        if((HAL_GetTick() - tickstart ) > PLL_TIMEOUT_VALUE)
                        {
                            return HAL_TIMEOUT;
                        }
                    }
                }
            }
            else
            {
                /* Check if there is a request to disable the PLL used as System clock source */
                if((RCC_OscInitStruct->PLL.PLLState) == RCC_PLL_OFF)
                {
                    return HAL_ERROR;
                }
                else
                {
                    /* Do not return HAL_ERROR if request repeats the current configuration */
                    pll_config = RCC->PLLCFGR;
#if defined (RCC_PLLCFGR_PLLR)
                    if (((RCC_OscInitStruct->PLL.PLLState) == RCC_PLL_OFF) ||
                        (READ_BIT(pll_config, RCC_PLLCFGR_PLLSRC) != RCC_OscInitStruct->PLL.PLLSource) ||
                        (READ_BIT(pll_config, RCC_PLLCFGR_PLLM) != (RCC_OscInitStruct->PLL.PLLM) << RCC_PLLCFGR_PLLM_Pos) ||
                        (READ_BIT(pll_config, RCC_PLLCFGR_PLLN) != (RCC_OscInitStruct->PLL.PLLN) << RCC_PLLCFGR_PLLN_Pos) ||
                        (READ_BIT(pll_config, RCC_PLLCFGR_PLLP) != (((RCC_OscInitStruct->PLL.PLLP >> 1U) - 1U)) << RCC_PLLCFGR_PLLP_Pos))
#else
                        if (((RCC_OscInitStruct->PLL.PLLState) == RCC_PLL_OFF) ||
            (READ_BIT(pll_config, RCC_PLLCFGR_PLLSRC) != RCC_OscInitStruct->PLL.PLLSource) ||
            (READ_BIT(pll_config, RCC_PLLCFGR_PLLM) != (RCC_OscInitStruct->PLL.PLLM) << RCC_PLLCFGR_PLLM_Pos) ||
            (READ_BIT(pll_config, RCC_PLLCFGR_PLLN) != (RCC_OscInitStruct->PLL.PLLN) << RCC_PLLCFGR_PLLN_Pos) ||
            (READ_BIT(pll_config, RCC_PLLCFGR_PLLP) != (((RCC_OscInitStruct->PLL.PLLP >> 1U) - 1U)) << RCC_PLLCFGR_PLLP_Pos) ||
            (READ_BIT(pll_config, RCC_PLLCFGR_PLLQ) != (RCC_OscInitStruct->PLL.PLLQ << RCC_PLLCFGR_PLLQ_Pos)))
#endif
                    {
                        return HAL_ERROR;
                    }
                }
            }
        }
        return HAL_OK;
    }


}

void error_handler()
{
    __disable_irq();
    while (1)
    {

    }
}

RTC_HandleTypeDef* get_rtc_handle()
{
    return &hrtc;
}

TIM_HandleTypeDef* get_timer_2_handle()
{
    return &htim2;
}

uint32_t get_timer_2_count()
{
    return htim2.Instance->CNT;
}

uint32_t get_timer_count(w_hal::timer_handle_t* arg_timer_handle)
{
    return arg_timer_handle->Instance->CNT;
}


void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    if (htim->Instance == TIM3)
    {
        HAL_IncTick();
    }
}






